JMeter/Report12092024/statistics.json
{
  "https://blazedemo.com/purchase.php" : {
    "transaction" : "https://blazedemo.com/purchase.php",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 321.15,
    "medianResTime" : 319.0,
    "minResTime" : 233.0,
    "maxResTime" : 526.0,
    "pct1ResTime" : 426.5000000000002,
    "pct2ResTime" : 521.55,
    "pct3ResTime" : 526.0,
    "throughput" : 1.099444780385905,
    "receivedKBytesPerSec" : 7.209737988565775,
    "sentKBytesPerSec" : 1.0758238964323017
  },
  "Purchase" : {
    "transaction" : "Purchase",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 368.5,
    "medianResTime" : 391.5,
    "minResTime" : 261.0,
    "maxResTime" : 405.0,
    "pct1ResTime" : 400.9,
    "pct2ResTime" : 404.8,
    "pct3ResTime" : 405.0,
    "throughput" : 1.09217999126256,
    "receivedKBytesPerSec" : 6.1648440913062466,
    "sentKBytesPerSec" : 1.2073708497160331
  },
  "Flight Search" : {
    "transaction" : "Flight Search",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 401.3500000000001,
    "medianResTime" : 350.5,
    "minResTime" : 294.0,
    "maxResTime" : 1271.0,
    "pct1ResTime" : 460.40000000000003,
    "pct2ResTime" : 1230.4999999999995,
    "pct3ResTime" : 1271.0,
    "throughput" : 1.0348217519532261,
    "receivedKBytesPerSec" : 7.418580547938117,
    "sentKBytesPerSec" : 0.9650925518704402
  },
  "https://blazedemo.com/confirmation.php" : {
    "transaction" : "https://blazedemo.com/confirmation.php",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 368.5,
    "medianResTime" : 391.5,
    "minResTime" : 261.0,
    "maxResTime" : 405.0,
    "pct1ResTime" : 400.9,
    "pct2ResTime" : 404.8,
    "pct3ResTime" : 405.0,
    "throughput" : 1.0922396373764403,
    "receivedKBytesPerSec" : 6.1651807656599855,
    "sentKBytesPerSec" : 1.2074367866309867
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 80,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 346.72499999999997,
    "medianResTime" : 322.5,
    "minResTime" : 233.0,
    "maxResTime" : 1271.0,
    "pct1ResTime" : 400.9,
    "pct2ResTime" : 454.1,
    "pct3ResTime" : 1271.0,
    "throughput" : 0.7820289741734932,
    "receivedKBytesPerSec" : 4.883690755195605,
    "sentKBytesPerSec" : 0.7520537424974095
  },
  "https://blazedemo.com/reserve.php" : {
    "transaction" : "https://blazedemo.com/reserve.php",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 401.3500000000001,
    "medianResTime" : 350.5,
    "minResTime" : 294.0,
    "maxResTime" : 1271.0,
    "pct1ResTime" : 460.40000000000003,
    "pct2ResTime" : 1230.4999999999995,
    "pct3ResTime" : 1271.0,
    "throughput" : 1.0444955086693126,
    "receivedKBytesPerSec" : 7.487931180802173,
    "sentKBytesPerSec" : 0.9741144636515563
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 295.90000000000003,
    "medianResTime" : 287.0,
    "minResTime" : 250.0,
    "maxResTime" : 392.0,
    "pct1ResTime" : 375.70000000000016,
    "pct2ResTime" : 391.5,
    "pct3ResTime" : 392.0,
    "throughput" : 1.098297638660077,
    "receivedKBytesPerSec" : 6.15979801619989,
    "sentKBytesPerSec" : 0.911672844590884
  },
  "Choose the Flight" : {
    "transaction" : "Choose the Flight",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 321.15,
    "medianResTime" : 319.0,
    "minResTime" : 233.0,
    "maxResTime" : 526.0,
    "pct1ResTime" : 426.5000000000002,
    "pct2ResTime" : 521.55,
    "pct3ResTime" : 526.0,
    "throughput" : 1.0993843447669307,
    "receivedKBytesPerSec" : 7.209341674912049,
    "sentKBytesPerSec" : 1.0757647592348285
  },
  "https://blazedemo.com/login" : {
    "transaction" : "https://blazedemo.com/login",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 295.90000000000003,
    "medianResTime" : 287.0,
    "minResTime" : 250.0,
    "maxResTime" : 392.0,
    "pct1ResTime" : 375.70000000000016,
    "pct2ResTime" : 391.5,
    "pct3ResTime" : 392.0,
    "throughput" : 1.0983579548574882,
    "receivedKBytesPerSec" : 6.160136299357461,
    "sentKBytesPerSec" : 0.9117229117469383
  }
}